<?php
$ERRORS = array();
// 考勤系统故障
$ERRORS['101'] = '考勤服务器上没有返回任何内容';
$ERRORS['102'] = '考勤服务器上返回的内容不包含员工考勤信息';

//代理服务故障
$ERRORS['201'] = '不明确的服务器异常';
$ERRORS['202'] = '考勤代理服务器连接异常';

//终端页面故障
$ERRORS['301'] = '考勤代理服务器没有返回数据';
$ERRORS['302'] = '考勤代理服务器返回的数据不包含异常编码';

//轮播广告
$ERRORS['401'] = '轮播广告不明确的服务器异常';
$ERRORS['402'] = '轮播广告服务器端数据为空';
$ERRORS['403'] = '轮播广告服务器端数据不包含错误编码字段';
$ERRORS['404'] = '轮播广告服务器端没有检索到图片文件';

// 打卡集中时间处理逻辑
$ERRORS['501'] = '获取打卡集中时间处理逻辑的配置时不明确的服务器异常';
$ERRORS['502'] = '获取打卡集中时间处理逻辑的配置时数据为空';
$ERRORS['503'] = '获取打卡集中时间处理逻辑的配置时不包含异常编码';
$ERRORS['504'] = '获取打卡集中时间处理逻辑的配置时没有日期的配置';
$ERRORS['505'] = '获取打卡集中时间处理逻辑的配置时没有时间的配置';
$ERRORS['506'] = '获取打卡集中时间处理逻辑的配置时没有楼层的时间配置';
$ERRORS['507'] = '考勤显示器有1分钟以上无任何考勤信息';
$ERRORS['508'] = '该打卡的时候，没人打卡';
$ERRORS['509'] = '打卡集中时间处理逻辑的时间配置格式不正确';
?>