export const errors = new Map([
    [ '101', '考勤服务器上没有返回任何内容' ],
    [ '102', '考勤服务器上返回的内容不包含员工考勤信息' ],

    [ '201', '不明确的服务器异常' ],
    [ '202', '考勤代理服务器连接异常' ],

    [ '301', '考勤代理服务器没有返回数据' ],
    [ '302', '考勤代理服务器返回的数据不包含异常编码' ],

    [ '401', '轮播广告不明确的服务器异常' ],
    [ '402', '轮播广告服务器端数据为空' ],
    [ '403', '轮播广告服务器端数据不包含错误编码字段' ],
    [ '404', '轮播广告服务器端没有检索到图片文件' ],

    [ '501', '获取打卡集中时间处理逻辑的配置时不明确的服务器异常' ],
    [ '502', '获取打卡集中时间处理逻辑的配置时数据为空' ],
    [ '503', '获取打卡集中时间处理逻辑的配置时不包含异常编码' ],
    [ '504', '获取打卡集中时间处理逻辑的配置时没有日期的配置' ],
    [ '505', '获取打卡集中时间处理逻辑的配置时没有时间的配置' ],
    [ '506', '获取打卡集中时间处理逻辑的配置时没有楼层的时间配置' ],
    [ '507', '考勤显示器有1分钟以上无任何考勤信息' ],
    [ '508', '该打卡的时候，没人打卡' ],
    [ '509', '打卡集中时间处理逻辑的时间配置格式不正确' ]
]);

/**
* 报警的频次及阈值。
*/
export const thresholds = new Map([
    [
        '101',
        new Map([
            [ 'toplimit', 300 ],
            [ 'threshold', 0.5 ]
        ])
    ],
    [
        '102',
        new Map([
            [ 'toplimit', 300 ],
            [ 'threshold', 0.05 ]
        ])
    ],
    [
        'default',
        new Map([
            [ 'toplimit', 100 ],
            [ 'threshold', 0.1 ]
        ])
    ]
]);
